Repository: DenisBaad/BackEndC-
Catalog: Src/Shared/Aquiles.Exception/ResourceMensagensDeErro.*.resx
Languages: es

# CNPJCPF_TAMANHO_INVALIDO
source: O Campo CPFCNPJ não pode ter menos que 11 e nem mais que 14 números
es: El campo CPFCNPJ no puede tener menos de 11 ni más de 14 números.

# CNPJ_INVALIDO
source: O CNPJ informado é inválido
es: El CNPJ informado es inválido.

# CPF_INVALIDO
source: O CPF informado é inválido
es: El CPF informado es inválido.

# DESCRICAO_OBRIGATORIA
source: A descrição deve ser informada
es: La descripción debe ser informada

# EMAIL_USUARIO_EMBRANCO
source: O Email do usuário deve ser informado.
es: El correo electrónico del usuario debe ser informado.

# EMAIL_USUARIO_INVALIDO
source: O Email do usuário é inválido.
es: El correo electrónico del usuario es inválido.

# EMAIL_USUARIO_JA_CADASTRADO
source: O Usuário informado já esta cadastrado no banco de dados.
es: El usuario informado ya está registrado en la base de datos.

# FATURA_FIM_VIGENCIA_OBRIGATORIA
source: A data de fim da vigência da fatura é obrigatória.
es: La fecha de finalización de la vigencia de la factura es obligatoria.

# FATURA_INICIO_VIGENCIA_OBRIGATORIA
source: A data de início da vigência da fatura é obrigatória.
es: La fecha de inicio de la vigencia de la factura es obligatoria.

# FATURA_NEGATIVA
source: Fatura não pode ser negativa
es: La factura no puede ser negativa.

# FATURA_VENCIMENTO
source: A data de vencimento da fatura não pode ser anterior à data atual.
es: La fecha de vencimiento de la factura no puede ser anterior a la fecha actual.

# IDENTIDADE_CARACTERES_ESPECIAIS
source: O campo identidade deverá conter somente números
es: El campo identidad deberá contener solo números.

# IDENTIDADE_TAMANHO_INVALIDO
source: O campo Identidade deverá ter no mínimo 6 e no máximo 20 números
es: El campo Identidad deberá tener como mínimo 6 y como máximo 20 números.

# LOGIN_INVALIDO
source: Parâmetros de login inválidos
es: Parámetros de inicio de sesión inválidos.

# NOME_CLIENTE_TAMANHO_INVALIDO
source: O Nome do cliente deve ter no mínimo 3 e no máximo 45 caracteres
es: El nombre del cliente debe tener como mínimo 3 y como máximo 45 caracteres.

# NOME_CLIENTE_VAZIO
source: O Nome do cliente deve ser informado
es: El nombre del cliente debe ser informado.

# NOME_FANTASIA_CARACTERES_ESPECIAIS
source: O Nome fantasia não poderá conter caracteres especiais
es: El nombre comercial no podrá contener caracteres especiales.

# NOME_FANTASIA_TAMANHO_INVALIDO
source: O Nome fantasia deve ter no mínimo 3 e no máximo 45 caracteres
es: El nombre comercial debe tener un mínimo de 3 y un máximo de 45 caracteres.

# NOME_USUARIO_EMBRANCO
source: O Nome do usuário deve ser informado.
es: El nombre de usuario debe ser informado. Perguntar ao ChatGPT

# ORGAO_EXPEDIDOR_CARACTERES_ESPECIAIS
source: O Órgão expedidor não poderá conter caracteres especiais
es: El órgano expedidor no podrá contener caracteres especiales.

# ORGAO_EXPEDIDOR_TAMANHO_INVALIDO
source: O Órgao expedidor deverá ter no máximo 10 caracteres
es: El órgano expedidor deberá tener como máximo 10 caracteres.

# ORGAO_EXPEDIDOR_VAZIO
source: Quando informada identidade deverá ser informado o órgão expedidor
es: Cuando se informe la identidad, deberá informarse el órgano expedidor.

# QUANTIDADE_USUARIO_NEGATIVO
source: Quantidade de usuários não pode ser zero
es: La cantidad de usuarios no puede ser cero

# SENHA_USUARIO_TAMANHO_INVALIDO
source: A senha deve conter no mínimo seis caracteres
es: La contraseña debe contener al menos seis caracteres.

# STATUS_OBRIGATORIO
source: O status deve ser informado
es: El estado debe ser informado.

# TIPO_DEVE_SER_INFORMADO
source: O tipo de cliente deve ser informado corretamente
es: El tipo de cliente debe ser informado correctamente.

# TOKEN_EXPIRADO
source: Realize o login novamente!
es: ¡Realice el inicio de sesión nuevamente!

# USUARIO_SEM_PERMISSAO
source: Você não tem permissão para acessar esse recurso
es: No tienes permiso para acceder a este recurso.

# VALOR_PLANO_NEGATIVO
source: Valor do plano não pode ser negativo
es: El valor del plan no puede ser negativo

# VIGENCIA_MES_NEGATIVA
source: Vigencia do mês deve ser maior que zero
es: La vigencia del mes debe ser mayor que cero
